---
kind: method
id: M:Autodesk.Revit.DB.LinkConversionData.Dispose
source: html/109bd75f-64cc-fec8-bf8f-a78890545c45.htm
---
# Autodesk.Revit.DB.LinkConversionData.Dispose Method

Releases all resources used by the LinkConversionData

## Syntax (C#)
```csharp
public void Dispose()
```